############## inter_class_center_loss ###############
layer {
  name: "inter_class_center_loss"
  type: "InterClassCenterLoss"
  bottom: "fc8_score"
  bottom: "label"
  top: "inter_class_center_loss"
  iter_class_center_loss_param {
    num_output: 12
    margin: 1.0
    center_filler {
      type: "xavier"
    }
  }
  loss_weight: 0.01
}
